판다스 버전 1.3.4에서 실행하였습니다.

In [1]:
# 라이브러리 버전을 맞춥니다.
!pip install pandas==1.3.4

Requirement already satisfied: pandas==1.3.4 in c:\users\it\anaconda3\lib\site-packages (1.3.4)
Requirement already satisfied: pytz>=2017.3 in c:\users\it\anaconda3\lib\site-packages (from pandas==1.3.4) (2021.3)
Requirement already satisfied: numpy>=1.17.3 in c:\users\it\anaconda3\lib\site-packages (from pandas==1.3.4) (1.21.5)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\it\anaconda3\lib\site-packages (from pandas==1.3.4) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\it\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas==1.3.4) (1.16.0)

In [2]:
# 버전 확인용
import pandas as pd

print("판다스 버전 :", pd.__version__)

판다스 버전 : 1.3.4

In [3]:
print("Hello World!!")

Hello World!!

변수와 자료형

In [4]:
age=3
print(age)

3

숫자형

In [5]:
age = 20
weight = "75"
pi = 3.14

In [6]:
type(age)

int

In [7]:
type(weight)

str

In [8]:
type(pi)

float

In [9]:
# 주석을 제거하고 실행하면 오류가 발생합니다.
# 오류가 발생하는 게 맞습니다.
# age/weight

문자열형

In [10]:
greeting = "Hello, World!"
print(greeting)

Hello, World!

In [11]:
article = '''오늘의 날씨를 말씀드립니다.
중부내륙지방에는 많은 비가 내릴 예정이고
남부해안지방은 쨍쨍합니다.'''

print(article)

오늘의 날씨를 말씀드립니다.
중부내륙지방에는 많은 비가 내릴 예정이고
남부해안지방은 쨍쨍합니다.

### 리스트 타입

In [12]:
gu = ['종로구','강남구','용산구',"서대문구"]
print(gu)

['종로구', '강남구', '용산구', '서대문구']

In [13]:
type(gu)

list

In [14]:
gu[2]

'용산구'

In [15]:
gu[0:3]

['종로구', '강남구', '용산구']

In [16]:
gu[:]

['종로구', '강남구', '용산구', '서대문구']

In [17]:
gu[:-2]

['종로구', '강남구']

In [18]:
gu[-1]

'서대문구'

In [19]:
gu[-1][0]

'서'

In [20]:
gu[-1][-1]

'구'

In [21]:
gu[-1][:3]

'서대문'

In [22]:
gu[::-1]

['서대문구', '용산구', '강남구', '종로구']

리스트 타입 메서드

In [23]:
gu = ['종로구','강남구','용산구',"서대문구"]
append_gu=['은평구','마포구']

gu.append(append_gu)
print(gu)

['종로구', '강남구', '용산구', '서대문구', ['은평구', '마포구']]

In [24]:
gu = ['종로구','강남구','용산구',"서대문구"]
append_gu='은평구'

gu.append(append_gu)
print(gu)

['종로구', '강남구', '용산구', '서대문구', '은평구']

In [25]:
gu[4]

'은평구'

In [26]:
gu = ['종로구','강남구','용산구',"서대문구"]
extend_gu=['은평구','마포구']

gu.extend(extend_gu)
print(gu)

['종로구', '강남구', '용산구', '서대문구', '은평구', '마포구']

In [27]:
gu.remove('강남구')
print(gu)

['종로구', '용산구', '서대문구', '은평구', '마포구']

In [28]:
gu = ['종로구','강남구','용산구',"서대문구", "용산구", "용산구", "용산구"]
gu.count('용산구')

4

### 딕셔너리 타입

In [29]:
dict_variable = {"동해섬":"독도", "남해섬":"제주도", "서해섬":"실미도"}
print(dict_variable)

{'동해섬': '독도', '남해섬': '제주도', '서해섬': '실미도'}

In [30]:
print(dict_variable.keys())
print(dict_variable.values())

dict_keys(['동해섬', '남해섬', '서해섬'])
dict_values(['독도', '제주도', '실미도'])

In [31]:
dict_variable["동해섬"]

'독도'

In [32]:
dict_variable['서울'] ='여의도'

In [33]:
dict_variable

{'동해섬': '독도', '남해섬': '제주도', '서해섬': '실미도', '서울': '여의도'}

In [34]:
dict_variable['동해섬'] ='울릉도'

In [35]:
dict_variable

{'동해섬': '울릉도', '남해섬': '제주도', '서해섬': '실미도', '서울': '여의도'}

In [36]:
dict_variable_add = {"태평양":"하와이"}
dict_variable.update(dict_variable_add)

In [37]:
dict_variable

{'동해섬': '울릉도', '남해섬': '제주도', '서해섬': '실미도', '서울': '여의도', '태평양': '하와이'}

튜플 타입

In [38]:
tuple_type = ('아시아','아메리카','아프리카','유럽')
print(tuple_type)
print("데이터 타입 =",type(tuple_type))

('아시아', '아메리카', '아프리카', '유럽')
데이터 타입 = <class 'tuple'>

In [39]:
tuple_type[0]

'아시아'

In [40]:
# 주석을 제거하고 실행하면 오류가 발생합니다.
# 오류가 발생하는 게 맞습니다.
# tuple_type[0] = '중앙아시아'

세트 타입

In [41]:
set_variable = {'신발','옷','신발','가방','열쇠'}
print(set_variable)
print("데이터 타입 =",type(set_variable))

{'옷', '가방', '열쇠', '신발'}
데이터 타입 = <class 'set'>

In [42]:
set_variable1 = {2,4,6,8,10,12,14,16}
set_variable2 = {4,8,12,16,20,24}

set_variable1.intersection(set_variable2)

{4, 8, 12, 16}

In [43]:
set_variable1.union(set_variable2)

{2, 4, 6, 8, 10, 12, 14, 16, 20, 24}

In [44]:
set_variable1.difference(set_variable2)

{2, 6, 10, 14}

if ~ else 조건문

In [45]:
print("시작 : 알람 시계가 울리는 시간은?")
term = "주중"

if term == '주중':
    print("조건 만족")
    print("7시에 울린다.")

else:
    print("조건 불만족")
    print("9시에 울린다.")

시작 : 알람 시계가 울리는 시간은?
조건 만족
7시에 울린다.

In [46]:
print("시작 : 알람 시계가 울리는 시간은?")
print()

term1 = "주중"
term2 = '여행 중'

now = term1

if now == term1:
    print("주중 입니다. 7시에 알람이 울립니다.")
elif now ==term2:
    print("주말이고 여행 중입니다. 8시에 알람이 울립니다.")
else:
    print("평범한 주말입니다. 9시에 알람이 울립니다.")

시작 : 알람 시계가 울리는 시간은?

주중 입니다. 7시에 알람이 울립니다.

for문, while문

In [47]:
customers = ['A고객', 'B고객', 'C고객']
for customer in customers:
    print(customer,'님, 안녕하세요.')

A고객 님, 안녕하세요.
B고객 님, 안녕하세요.
C고객 님, 안녕하세요.

In [48]:
numbers = [2,3,4]
for n in numbers:
    area = n * n * 3.14
    print("반지름:", n, ' 원넓이:', area)

반지름: 2  원넓이: 12.56
반지름: 3  원넓이: 28.26
반지름: 4  원넓이: 50.24

In [49]:
numbers = [2,3,4]
len(numbers)

3

구구단 만들기

In [50]:
for i in range(9):
    print(5)

5
5
5
5
5
5
5
5
5

In [51]:
for i in range(9):
    print("{} X {}".format(5, i))

5 X 0
5 X 1
5 X 2
5 X 3
5 X 4
5 X 5
5 X 6
5 X 7
5 X 8

In [52]:
for i in range(9):
    print("{} X {}".format(5, i+1))

5 X 1
5 X 2
5 X 3
5 X 4
5 X 5
5 X 6
5 X 7
5 X 8
5 X 9

In [53]:
for i in range(9):
    print("{} X {} = {}".format(5, i+1, 5*(i+1)))

5 X 1 = 5
5 X 2 = 10
5 X 3 = 15
5 X 4 = 20
5 X 5 = 25
5 X 6 = 30
5 X 7 = 35
5 X 8 = 40
5 X 9 = 45

In [54]:
print(5%2)
print(10%2)

1
0

In [55]:
for i in range(9):
    result = 5*(i+1)
    if result % 2 ==0:
        print("{} X {} = {}".format(5, i+1, 5*(i+1)))

5 X 2 = 10
5 X 4 = 20
5 X 6 = 30
5 X 8 = 40

In [56]:
for i in range(9):
    result = 5*(i+1)
    if result % 2 ==0:
        print("{} X {} = {}".format(5, i+1, 5*(i+1)))
    else:
        print("{}는 홀수입니다.".format(result))

5는 홀수입니다.
5 X 2 = 10
15는 홀수입니다.
5 X 4 = 20
25는 홀수입니다.
5 X 6 = 30
35는 홀수입니다.
5 X 8 = 40
45는 홀수입니다.

In [57]:
days = ['일요일','월요일','화요일','수요일','목요일','금요일','토요일']
members = ['홍길동','고길동','임꺽정','콩쥐']

for day in days:
    if (day == '월요일'):
        for member in members:
            print("{}님 한주를 시작하는 {} 입니다. 기운차고 행복한 한주되시기 바랍니다.".format(member, day))
    elif (day == '금요일'):
        for member in members:
            print("{}님 한주 마무리는 잘 하셨나요? 즐거운 주말되시기 바랍니다.".format(member))

홍길동님 한주를 시작하는 월요일 입니다. 기운차고 행복한 한주되시기 바랍니다.
고길동님 한주를 시작하는 월요일 입니다. 기운차고 행복한 한주되시기 바랍니다.
임꺽정님 한주를 시작하는 월요일 입니다. 기운차고 행복한 한주되시기 바랍니다.
콩쥐님 한주를 시작하는 월요일 입니다. 기운차고 행복한 한주되시기 바랍니다.
홍길동님 한주 마무리는 잘 하셨나요? 즐거운 주말되시기 바랍니다.
고길동님 한주 마무리는 잘 하셨나요? 즐거운 주말되시기 바랍니다.
임꺽정님 한주 마무리는 잘 하셨나요? 즐거운 주말되시기 바랍니다.
콩쥐님 한주 마무리는 잘 하셨나요? 즐거운 주말되시기 바랍니다.

컴프리핸션

In [58]:
even = []
for i in range(9):
    if  i % 2 ==0:
        even.append(i)

print(even)

[0, 2, 4, 6, 8]

In [59]:
even = [ i for i in range(9) if i % 2 ==0]
print(even)

[0, 2, 4, 6, 8]

while 문

In [60]:
i = 0
sum_value = 0
while (sum_value<100):
    i = i + 1
    sum_value += i

    print("더할값 :{}  누적값 : {}".format(i, sum_value))
print()
print("최종값", sum_value)

더할값 :1  누적값 : 1
더할값 :2  누적값 : 3
더할값 :3  누적값 : 6
더할값 :4  누적값 : 10
더할값 :5  누적값 : 15
더할값 :6  누적값 : 21
더할값 :7  누적값 : 28
더할값 :8  누적값 : 36
더할값 :9  누적값 : 45
더할값 :10  누적값 : 55
더할값 :11  누적값 : 66
더할값 :12  누적값 : 78
더할값 :13  누적값 : 91
더할값 :14  누적값 : 105

최종값 105

함수

In [61]:
def shutdown():
    """컴퓨터를 끄는 함수"""
    print("이제 컴퓨터를 끄겠습니다.")

In [62]:
shutdown()

이제 컴퓨터를 끄겠습니다.

In [63]:
def calculate_circle_area(radius):
    """반지름을 입력하면 넓이를 화면에 출력한다"""
    area = (radius*radius)*3.14
    print("원 넓이 =", area)

calculate_circle_area(radius=3)

원 넓이 = 28.26

BMI 계산기 만들기

In [64]:
def calculate_bmi(height, weight):
    """BMI지수 계산"""
    bmi = weight / (height**2)
    bmi = round(bmi, 2)
    return bmi

In [65]:
calculate_bmi(height=1.77, weight=75)

23.94

In [66]:
bmi = calculate_bmi(height=1.77, weight=75)

if bmi < 18.5:
    print("저체중입니다.")
elif bmi < 23:
    print('정상입니다.')
elif bmi< 25:
    print('과체중입니다.')
else:
    print('비만입니다.')

과체중입니다.

함수로 구성된 함수

In [67]:
def collect_data():
    """자연어 데이터를 수집한다"""
    print("데이터를 수집합니다.")

def preprocessing_data():
    """수집한 데이터를 전처리한다."""
    print("데이터 전처리합니다.")

def save_data():
    """전처리 결과를 저장합니다"""
    print("파일을 저장합니다.")

collect_data()
preprocessing_data()
save_data()

데이터를 수집합니다.
데이터 전처리합니다.
파일을 저장합니다.

In [68]:
def collect_to_save():
    """자연어 데이터를 수집, 전처리, 결과 저장하는 함수"""
    collect_data()
    preprocessing_data()
    save_data()

collect_to_save()

데이터를 수집합니다.
데이터 전처리합니다.
파일을 저장합니다.

개인 정보 보호 함수 만들기

In [69]:
names = ["홍길동", '고길동', '둘리']
for index, name in enumerate(names):
    print('names[{}] = {}'.format(index, name))

names[0] = 홍길동
names[1] = 고길동
names[2] = 둘리

In [70]:
examples = ['안녕','하세요']
"".join(examples)

'안녕하세요'

In [71]:
def input_symbol(name):
    """가운데 글자를 *표로 변경한다"""

    result_name = []
    for idx, key in enumerate(name):
        if idx==1:
            symbol="*"
            result_name.append(symbol)
        else:
            result_name.append(key)

    result_name = "".join(result_name)

    return result_name

In [72]:
input_symbol(name="홍길동")

'홍*동'

In [73]:
def change_names(name1, name2):
    """이름들을 전달받으면 가운데 글자를 *표로 변경하고 반환한다"""
    result_name1 = input_symbol(name1)
    result_name2 = input_symbol(name2)

    return result_name1, result_name2

In [74]:
change_names(name1="홍길동", name2="고길동")

('홍*동', '고*동')

In [75]:
protected_name1, protected_name2 = change_names(name1="홍길동", name2="고길동")
print(protected_name1, protected_name2)

홍*동 고*동

In [76]:
def change_names_for(names):
    """이름을 복수로 받아서 for로 처리하는 구조"""
    changed_names = []
    for name in names:
        changed_name = input_symbol(name)
        changed_names.append(changed_name)

    return changed_names

In [77]:
change_names_for(names=['홍길동','고길동'])

['홍*동', '고*동']

변수 범위

In [78]:
# 주석을 제거하고 실행하면 오류가 발생합니다.
# 오류가 발생하는 게 맞습니다.
# result_name1

In [79]:
age = 30
def age_local():
    age=10
    print("(지역변수)전 {} 살 입니다.".format(age))

def age_global():
    print("(전역변수)전 {} 살 입니다.".format(age))

In [80]:
age_local()
age_global()

(지역변수)전 10 살 입니다.
(전역변수)전 30 살 입니다.

판다스

데이터프레임 생성

In [81]:
import pandas as pd

# 판다스, 데이터프레임(DataFrame) 생성
sample_data = {"a":[4,5,6],
               "b":[7,8,9],
               "c":[10,11,12]}

df = pd.DataFrame(sample_data)
df_index = pd.DataFrame(sample_data, index=[1,2,3])

In [82]:
df

   a  b   c
0  4  7  10
1  5  8  11
2  6  9  12

In [83]:
df_index

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [84]:
df_1 = pd.DataFrame(
    [[4,7,10],
     [5,8,11],
     [6,9,12]],
     index=[1,2,3],
     columns=['a','b','c']
     )

df_1

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

필요한 데이터를 추출하고 정리하는 pivot()

In [85]:
df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two','two'],
                   'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'baz': [1, 2, 3, 4, 5, 6],
                   'zoo': ['x', 'y', 'z', 'q', 'w', 't']})

df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [86]:
df.pivot(index='foo', columns='bar', values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [87]:
df.pivot(index='foo', columns='bar', values=['baz', 'zoo'])

    baz       zoo
bar   A  B  C   A  B  C
foo
one   1  2  3   x  y  z
two   4  5  6   q  w  t

여러 데이터를 이어주는 concat()

In [88]:
data1 = [['a', 1],
         ['b', 2]]
data2 = [['c', 3],
         ['d', 4]]

df1 = pd.DataFrame(data1, columns=['letter', 'number'])
df2 = pd.DataFrame(data2, columns=['letter', 'number'])

display(df1)
display(df2)

  letter  number
0      a       1
1      b       2

  letter  number
0      c       3
1      d       4

In [89]:
pd.concat([df1, df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [90]:
df3 = pd.DataFrame([['e', 5, 'cat'], ['f', 6, 'dog']],
                   columns=['letter', 'number', 'animal'])

In [91]:
pd.concat([df1, df3])

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      e       5    cat
1      f       6    dog

In [92]:
pd.concat([df1, df3], join="inner")

  letter  number
0      a       1
1      b       2
0      e       5
1      f       6

In [93]:
df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
                   columns=['animal', 'name'])

df4

   animal    name
0    bird   polly
1  monkey  george

In [94]:
pd.concat([df1, df4], axis=1)

  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

데이터를 정렬하는 sort_values()

In [95]:
import numpy as np

df = pd.DataFrame({
    'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
    'col2': [2, 1, 9, 8, 7, 4],
    'col3': [0, 1, 9, 4, 2, 3],
    'col4': ['a', 'B', 'c', 'D', 'e', 'F']})
df

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F

In [96]:
df.sort_values(by=['col1'])

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

In [97]:
df.sort_values(by='col1', ascending=False)

  col1  col2  col3 col4
4    D     7     2    e
5    C     4     3    F
2    B     9     9    c
0    A     2     0    a
1    A     1     1    B
3  NaN     8     4    D

In [98]:
 df.sort_values(by=['col1', 'col2'])

  col1  col2  col3 col4
1    A     1     1    B
0    A     2     0    a
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

In [99]:
df.sort_values(by='col1', ascending=False, na_position='first')

  col1  col2  col3 col4
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F
2    B     9     9    c
0    A     2     0    a
1    A     1     1    B

이름을 바꾸는 rename()

In [100]:
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})
df

   A  B
0  1  4
1  2  5
2  3  6

In [101]:
df.rename(columns={"A": "a", "B": "b"})

   a  b
0  1  4
1  2  5
2  3  6

In [102]:
df.rename({'A':'aa', 'B':'bb'}, axis='columns')

   aa  bb
0   1   4
1   2   5
2   3   6

In [103]:
df.rename({1: 10, 2: 20}, axis='index')

    A  B
0   1  4
10  2  5
20  3  6

인덱스 번호를 다루는 sort_index()와 reset_index()

In [104]:
df = pd.DataFrame([1, 2, 3, 4, 5], index=[100, 29, 234, 1, 150],
                  columns=['A'])

df

     A
100  1
29   2
234  3
1    4
150  5

In [105]:
df.sort_index()

     A
1    4
29   2
100  1
150  5
234  3

In [106]:
df.sort_index(ascending=False)

     A
234  3
150  5
100  1
29   2
1    4

In [107]:
df = pd.DataFrame([('bird', 389.0),
                   ('bird', 24.0),
                   ('mammal', 80.5),
                   ('mammal', np.nan)],
                  index=['falcon', 'parrot', 'lion', 'monkey'],
                  columns=('class', 'max_speed'))

df

         class  max_speed
falcon    bird      389.0
parrot    bird       24.0
lion    mammal       80.5
monkey  mammal        NaN

In [108]:
df.reset_index()

    index   class  max_speed
0  falcon    bird      389.0
1  parrot    bird       24.0
2    lion  mammal       80.5
3  monkey  mammal        NaN

In [109]:
df.reset_index(drop=True) # 인덱스 삭제하고 새롭게 0,1,2,3

    class  max_speed
0    bird      389.0
1    bird       24.0
2  mammal       80.5
3  mammal        NaN

값을 지우는 drop(), dropna()

In [110]:
df = pd.DataFrame(np.arange(12).reshape(3, 4),
                  columns=['A', 'B', 'C', 'D'])

df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [111]:
df.drop(columns=['B', 'C'])

   A   D
0  0   3
1  4   7
2  8  11

In [112]:
df.drop([0, 1])

   A  B   C   D
2  8  9  10  11

In [113]:
df.drop(index=[0,1], columns=['B','C'])

   A   D
2  8  11

In [114]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [np.nan, "1940-04-25", np.nan]})
df

       name        toy        born
0    Alfred        NaN         NaN
1    Batman  Batmobile  1940-04-25
2  Catwoman   Bullwhip         NaN

In [115]:
df.dropna()

     name        toy        born
1  Batman  Batmobile  1940-04-25

In [116]:
df.dropna(axis=1)

       name
0    Alfred
1    Batman
2  Catwoman

In [117]:
df.dropna(subset=['name','toy'])

       name        toy        born
1    Batman  Batmobile  1940-04-25
2  Catwoman   Bullwhip         NaN

데이터 추출

행을 기준으로 데이터 추출

In [118]:
df = pd.DataFrame({"ID":[1,2,3,3,5],
                   "국어":[80,90,75,75,90],
                   "영어":[85,100,70,70,95],
                   "수학":[75,95,65,65,80]})

df

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95
2   3  75   70  65
3   3  75   70  65
4   5  90   95  80

In [119]:
df[['국어','영어']]

   국어   영어
0  80   85
1  90  100
2  75   70
3  75   70
4  90   95

In [120]:
df[df['국어']>80]

   ID  국어   영어  수학
1   2  90  100  95
4   5  90   95  80

In [121]:
df.drop_duplicates()

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95
2   3  75   70  65
4   5  90   95  80

In [122]:
df.drop_duplicates(subset='국어')

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95
2   3  75   70  65

In [123]:
df.head(2)

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95

In [124]:
df.tail(2)

   ID  국어  영어  수학
3   3  75  70  65
4   5  90  95  80

In [125]:
df.sample(2)

   ID  국어   영어  수학
1   2  90  100  95
2   3  75   70  65

In [126]:
df.sample(frac=0.5)

   ID  국어  영어  수학
3   3  75  70  65
2   3  75  70  65

iloc[]와 loc[]

In [127]:
df.iloc[0, 2]

85

In [128]:
df.iloc[1:3]

   ID  국어   영어  수학
1   2  90  100  95
2   3  75   70  65

In [129]:
df.iloc[:,:]

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95
2   3  75   70  65
3   3  75   70  65
4   5  90   95  80

In [130]:
df.iloc[1:4,:]

   ID  국어   영어  수학
1   2  90  100  95
2   3  75   70  65
3   3  75   70  65

In [131]:
df.iloc[1:4,:3]

   ID  국어   영어
1   2  90  100
2   3  75   70
3   3  75   70

In [132]:
df.loc[:,['국어','영어']]

   국어   영어
0  80   85
1  90  100
2  75   70
3  75   70
4  90   95

In [133]:
df.loc[:2,['국어','영어']]

   국어   영어
0  80   85
1  90  100
2  75   70

In [134]:
df.loc[df['국어']>=80, ['국어','수학']]

   국어  수학
0  80  75
1  90  95
4  90  80

논리 연산자

In [135]:
df[df['국어']==75]

   ID  국어  영어  수학
2   3  75  70  65
3   3  75  70  65

In [136]:
df[df['국어']!=75]

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95
4   5  90   95  80

In [137]:
df[df['국어']>=80]

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95
4   5  90   95  80

In [138]:
df[(df['영어']>=80)&(df['국어']>=80)]

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95
4   5  90   95  80

In [139]:
df[(df['수학']>=70)|(df['국어']>=80)]

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95
4   5  90   95  80

In [140]:
df[~(df['수학']>=70)]

   ID  국어  영어  수학
2   3  75  70  65
3   3  75  70  65

데이터 요약

In [141]:
df = pd.DataFrame({"ID":[1,2,3,4,5],
                   "국어":[80,90,75,100,80],
                   "영어":[85,100,70,70, 75],
                   "수학":[75,95,65,95,np.nan]})

df

   ID   국어   영어    수학
0   1   80   85  75.0
1   2   90  100  95.0
2   3   75   70  65.0
3   4  100   70  95.0
4   5   80   75   NaN

In [142]:
df['영어'].value_counts()

70     2
85     1
100    1
75     1
Name: 영어, dtype: int64

In [143]:
df.shape

(5, 4)

In [144]:
df['영어'].nunique()

4

In [145]:
df['영어'].unique()

array([ 85, 100,  70,  75], dtype=int64)

In [146]:
df.describe()

             ID     국어          영어    수학
count  5.000000    5.0    5.000000   4.0
mean   3.000000   85.0   80.000000  82.5
std    1.581139   10.0   12.747549  15.0
min    1.000000   75.0   70.000000  65.0
25%    2.000000   80.0   70.000000  72.5
50%    3.000000   80.0   75.000000  85.0
75%    4.000000   90.0   85.000000  95.0
max    5.000000  100.0  100.000000  95.0

In [147]:
df.sum()

ID     15.0
국어    425.0
영어    400.0
수학    330.0
dtype: float64

In [148]:
df[['국어','영어','수학']].sum()

국어    425.0
영어    400.0
수학    330.0
dtype: float64

In [149]:
df[['국어','영어','수학']].median()

국어    80.0
영어    75.0
수학    85.0
dtype: float64

In [150]:
df['수학'].std()

15.0

결측치 처리

In [151]:
df

   ID   국어   영어    수학
0   1   80   85  75.0
1   2   90  100  95.0
2   3   75   70  65.0
3   4  100   70  95.0
4   5   80   75   NaN

In [152]:
df.fillna(9999)

   ID   국어   영어      수학
0   1   80   85    75.0
1   2   90  100    95.0
2   3   75   70    65.0
3   4  100   70    95.0
4   5   80   75  9999.0

In [153]:
df.fillna(df['수학'].mean())

   ID   국어   영어    수학
0   1   80   85  75.0
1   2   90  100  95.0
2   3   75   70  65.0
3   4  100   70  95.0
4   5   80   75  82.5

칼럼 생성

In [154]:
df = pd.DataFrame({"A":range(1, 13),
                    "B":np.random.randint(0, 12, size=12)}) #①
df.head()

   A   B
0  1   9
1  2   1
2  3   5
3  4   0
4  5  10

In [155]:
df.assign(plus = lambda x:df['A']+df['B'])

     A   B  plus
0    1   9    10
1    2   1     3
2    3   5     8
3    4   0     4
4    5  10    15
5    6   2     8
6    7   9    16
7    8   5    13
8    9   7    16
9   10   8    18
10  11   9    20
11  12   5    17

In [156]:
df['plus'] = df['A']+df['B']

In [157]:
pd.qcut(df['plus'], 3 , labels={"A", "B", 'C'})

0     B
1     A
2     A
3     A
4     B
5     A
6     B
7     B
8     B
9     C
10    C
11    C
Name: plus, dtype: category
Categories (3, object): ['A' < 'B' < 'C']

In [158]:
df['category'] = pd.qcut(df['plus'], 3 , labels={"A", "B", 'C'})
df

     A   B  plus category
0    1   9    10        B
1    2   1     3        A
2    3   5     8        A
3    4   0     4        A
4    5  10    15        B
5    6   2     8        A
6    7   9    16        B
7    8   5    13        B
8    9   7    16        B
9   10   8    18        C
10  11   9    20        C
11  12   5    17        C

In [159]:
df[df['category']=='A']

   A  B  plus category
1  2  1     3        A
2  3  5     8        A
3  4  0     4        A
5  6  2     8        A

데이터 그룹화

In [160]:
import seaborn as sns

print("seaborn 버전 :", sns.__version__)

seaborn 버전 : 0.11.2

In [161]:
import seaborn as sns

df = sns.load_dataset("mpg") #①
df.head(3)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite

In [162]:
df.groupby(by="origin").size()

origin
europe     70
japan      79
usa       249
dtype: int64

In [163]:
df.groupby(by="origin").min()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,name
origin,,,,,,,,
europe,16.2,4,68.0,46.0,1825,12.2,70,audi 100 ls
japan,18.0,3,70.0,52.0,1613,11.4,70,datsun 1200
usa,9.0,4,85.0,52.0,1800,8.0,70,amc ambassador brougham

In [164]:
df.groupby(by="origin").mean()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
origin,,,,,,,
europe,27.891429,4.157143,109.142857,80.558824,2423.300000,16.787143,75.814286
japan,30.450633,4.101266,102.708861,79.835443,2221.227848,16.172152,77.443038
usa,20.083534,6.248996,245.901606,119.048980,3361.931727,15.033735,75.610442

In [165]:
df.groupby(by="origin")[['horsepower', 'weight']].mean()

        horsepower       weight
origin
europe   80.558824  2423.300000
japan    79.835443  2221.227848
usa     119.048980  3361.931727

순위를 구할 때 사용하는 rank()

In [166]:
df['cylinders'].unique()

array([8, 4, 6, 3, 5], dtype=int64)

In [167]:
display(df.head(3))
display(df.tail(3))

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10

In [168]:
df['cylinders'].rank(method='min')

0      296.0
1      296.0
2      296.0
3      296.0
4      296.0
       ...
393      5.0
394      5.0
395      5.0
396      5.0
397      5.0
Name: cylinders, Length: 398, dtype: float64

In [169]:
df['cylinders'].rank(method='dense')

0      5.0
1      5.0
2      5.0
3      5.0
4      5.0
      ...
393    2.0
394    2.0
395    2.0
396    2.0
397    2.0
Name: cylinders, Length: 398, dtype: float64

In [170]:
df['cylinders'].rank(ascending=False, method='dense')

0      1.0
1      1.0
2      1.0
3      1.0
4      1.0
      ...
393    4.0
394    4.0
395    4.0
396    4.0
397    4.0
Name: cylinders, Length: 398, dtype: float64

데이터 병합

In [171]:
adf = pd.DataFrame({"x1": ["A", "B", "C"], "x2": [1, 2, 3]})
bdf = pd.DataFrame({"x1": ["A", "B", "D"], "x3": ["T", "F", "T"]})

display(adf)
display(bdf)

  x1  x2
0  A   1
1  B   2
2  C   3

  x1 x3
0  A  T
1  B  F
2  D  T

In [172]:
pd.merge(adf, bdf, on='x1')

  x1  x2 x3
0  A   1  T
1  B   2  F

In [173]:
pd.merge(adf, bdf, how='right', on='x1')

  x1   x2 x3
0  A  1.0  T
1  B  2.0  F
2  D  NaN  T

In [174]:
pd.merge(adf, bdf, how='left', on='x1')

  x1  x2   x3
0  A   1    T
1  B   2    F
2  C   3  NaN

In [175]:
pd.merge(adf, bdf, how='outer', on='x1')

  x1   x2   x3
0  A  1.0    T
1  B  2.0    F
2  C  3.0  NaN
3  D  NaN    T